# Введение в Data Science и машинное обучение

Анатолий Карпов / Bioinformatics Institute

https://stepik.org/course/4852/

## 1. Введение

### 1.4. Pandas, Dataframes, нет, панды тут ни при чем

[Pandas](https://pandas.pydata.org/pandas-docs/stable/) и [Numpy](http://www.numpy.org/)

*Онлайн с возможностью запуска на gpu https://colab.research.google.com*

[Данные](https://stepik.org/media/attachments/course/4852/StudentsPerformance.csv), которые мы будем использовать в этом и следующих уроках

In [1]:
import pandas as pd
import numpy as np

In [2]:
students_performance = pd.read_csv('data\\StudentsPerformance.csv')

In [3]:
students_performance.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [4]:
students_performance.tail(1)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
999,female,group D,some college,free/reduced,none,77,86,86

In [5]:
students_performance.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [6]:
students_performance.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [7]:
students_performance.shape

(1000, 8)

In [8]:
students_performance.iloc[0:5, 0:3]

   gender race/ethnicity parental level of education
0  female        group B           bachelor's degree
1  female        group C                some college
2  female        group B             master's degree
3    male        group A          associate's degree
4    male        group C                some college

In [9]:
students_performance.iloc[[0, 3, 10], [0, 5, -1]]

    gender  math score  writing score
0   female          72             74
3     male          47             44
10    male          58             52

In [10]:
students_performance_with_names = students_performance.iloc[[0, 3, 4, 7, 8]]

In [11]:
students_performance_with_names

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67

In [12]:
students_performance_with_names.index = ['Cersei', 'Tywin', 'Gregor', 'Joffre', 'Ilyn Payne']

In [13]:
students_performance_with_names

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
Cersei,female,group B,bachelor's degree,standard,none,72,72,74
Tywin,male,group A,associate's degree,free/reduced,none,47,57,44
Gregor,male,group C,some college,standard,none,76,78,75
Joffre,male,group B,some college,free/reduced,none,40,43,39
Ilyn Payne,male,group D,high school,free/reduced,completed,64,64,67

In [14]:
students_performance_with_names.loc[['Cersei', 'Joffre']]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
Cersei,female,group B,bachelor's degree,standard,none,72,72,74
Joffre,male,group B,some college,free/reduced,none,40,43,39

In [15]:
students_performance_with_names.loc[['Cersei', 'Joffre'], ['gender', 'writing score']]

        gender  writing score
Cersei  female             74
Joffre    male             39

In [16]:
students_performance_with_names.iloc[:, 0]

Cersei        female
Tywin           male
Gregor          male
Joffre          male
Ilyn Payne      male
Name: gender, dtype: object

In [17]:
type(students_performance_with_names.iloc[:, 0])

pandas.core.series.Series

In [18]:
type(students_performance_with_names.loc[['Cersei', 'Joffre'], ['gender', 'writing score']])

pandas.core.frame.DataFrame

In [19]:
my_series_1 = pd.Series([1, 2, 3], index = ['Cersei', 'Tywin', 'Gregor'])
my_series_2 = pd.Series([4, 5, 6], index = ['Cersei', 'Tywin', 'Gregor'])

In [20]:
pd.DataFrame({'col_name_1': my_series_1, 'col_name_2': my_series_2})

        col_name_1  col_name_2
Cersei           1           4
Tywin            2           5
Gregor           3           6

In [21]:
# выдаст серию, хранящуюся в колонке 'gender'
students_performance_with_names['gender']

Cersei        female
Tywin           male
Gregor          male
Joffre          male
Ilyn Payne      male
Name: gender, dtype: object

In [22]:
type(students_performance_with_names['gender'])

pandas.core.series.Series

In [23]:
students_performance_with_names['gender'].shape

(5,)

In [24]:
# выдаст датафрейм, состоящий из колонки 'gender'
students_performance_with_names[['gender']]

            gender
Cersei      female
Tywin         male
Gregor        male
Joffre        male
Ilyn Payne    male

In [25]:
type(students_performance_with_names[['gender']])

pandas.core.frame.DataFrame

In [26]:
students_performance_with_names[['gender']].shape

(5, 1)

In [27]:
students_performance.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [28]:
# df.get_dtype_counts() уже не рекомендуется, взамен есть df.dtypes.value_counts()
students_performance.dtypes.value_counts()

object    5
int64     3
dtype: int64

In [29]:
students_performance.index

RangeIndex(start=0, stop=1000, step=1)

In [30]:
students_performance_with_names.index

Index(['Cersei', 'Tywin', 'Gregor', 'Joffre', 'Ilyn Payne'], dtype='object')

In [31]:
students_performance.size

8000

In [32]:
students_performance.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

### 1.5. Фильтрация данных

Научимся фильтровать и преобразовывать данные:

- Познакомимся с методом [query](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.query.html)
- Освоим другие приемы по работе с данными

In [33]:
students_performance.loc[students_performance.gender == 'female', ['gender', 'writing score']].head()

   gender  writing score
0  female             74
1  female             88
2  female             93
5  female             78
6  female             92

In [34]:
mean_writing_score = students_performance['writing score'].mean()
mean_writing_score

68.054

In [35]:
students_performance.loc[students_performance['writing score'] > mean_writing_score].head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78

In [36]:
students_performance[(students_performance['writing score'] > 100) & (students_performance.gender == 'female')]

Empty DataFrame
Columns: [gender, race/ethnicity, parental level of education, lunch, test preparation course, math score, reading score, writing score]
Index: []

In [37]:
querry = (students_performance['writing score'] > mean_writing_score) & (students_performance.gender == 'female')
students_performance.loc[querry].head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92

In [38]:
students_performance.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [39]:
# переименуем многосложные названия стольбцов
columns_to_rename = {
    'race/ethnicity': 'race_ethnicity', 
    'parental level of education': 'parental_level_of_education', 
    'test preparation course': 'test_preparation_course', 
    'math score': 'math_score', 
    'reading score': 'reading_score',
    'writing score': 'writing_score'
}

students_performance = students_performance.rename(columns=columns_to_rename)
students_performance.columns

Index(['gender', 'race_ethnicity', 'parental_level_of_education', 'lunch',
       'test_preparation_course', 'math_score', 'reading_score',
       'writing_score'],
      dtype='object')

In [40]:
students_performance.head()

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [41]:
students_performance.query('writing_score > 74 & gender == "female"').head()

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
15,female,group C,some high school,standard,none,69,75,78

In [42]:
writing_score_query = 78
students_performance.query('writing_score > @writing_score_query').head()

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
6,female,group B,some college,standard,completed,88,95,92
16,male,group C,high school,standard,none,88,89,86
24,male,group D,bachelor's degree,free/reduced,completed,74,71,80

In [43]:
# not pandas way
score_columns = [i for i in list(students_performance) if 'score' in i]
score_columns

['math_score', 'reading_score', 'writing_score']

In [44]:
students_performance[score_columns].head()

   math_score  reading_score  writing_score
0          72             72             74
1          69             90             88
2          90             95             93
3          47             57             44
4          76             78             75

In [45]:
# pandas way --> filter
students_performance.filter(like='score').head()

   math_score  reading_score  writing_score
0          72             72             74
1          69             90             88
2          90             95             93
3          47             57             44
4          76             78             75

In [46]:
students_performance_with_names.filter(like='e', axis=0)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
Cersei,female,group B,bachelor's degree,standard,none,72,72,74
Gregor,male,group C,some college,standard,none,76,78,75
Joffre,male,group B,some college,free/reduced,none,40,43,39
Ilyn Payne,male,group D,high school,free/reduced,completed,64,64,67

```
Очень полезный метод для больших датафрэймов. 
Для применения regex, ознакомьтесь с регулярными выражениями в питоне (библиотека re), в regex можно указывать как паттерн в виде строки, так и скомпилированный в re паттерн.
axis можно указывать как 0, 1 или как 'index', 'columns' соответственно
```

### 1.6. Группировка и агрегация, ничего, скоро привыкнем

Научимся группировать и аггрегировать данные

- Изучим как использовать [groupby](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.groupby.html) в связке с [aggregate](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.aggregate.html)

In [47]:
students_performance.groupby('gender').mean()

        math_score  reading_score  writing_score
gender
female   63.633205      72.608108      72.467181
male     68.728216      65.473029      63.311203

In [48]:
students_performance.groupby('gender') \
    .aggregate({'math_score': 'mean', 'reading_score': 'mean'})

        math_score  reading_score
gender
female   63.633205      72.608108
male     68.728216      65.473029

In [49]:
students_performance.groupby('gender', as_index=False) \
    .aggregate({'math_score': 'mean', 'reading_score': 'mean'})

   gender  math_score  reading_score
0  female   63.633205      72.608108
1    male   68.728216      65.473029

In [50]:
students_performance.groupby('gender', as_index=False) \
    .aggregate({'math_score': 'mean', 'reading_score': 'mean'}) \
    .rename(columns = {'math_score': 'mean_math_score', 'reading_score': 'mean_reading_score'})

   gender  mean_math_score  mean_reading_score
0  female        63.633205           72.608108
1    male        68.728216           65.473029

In [51]:
students_performance.groupby(['gender', 'race_ethnicity'], as_index=False) \
    .aggregate({'math_score': 'mean', 'reading_score': 'mean'}) \
    .rename(columns = {'math_score': 'mean_math_score', 'reading_score': 'mean_reading_score'})

   gender race_ethnicity  mean_math_score  mean_reading_score
0  female        group A        58.527778           69.000000
1  female        group B        61.403846           71.076923
2  female        group C        62.033333           71.944444
3  female        group D        65.248062           74.046512
4  female        group E        70.811594           75.840580
5    male        group A        63.735849           61.735849
6    male        group B        65.930233           62.848837
7    male        group C        67.611511           65.424460
8    male        group D        69.413534           66.135338
9    male        group E        76.746479           70.295775

In [52]:
students_performance.groupby(['gender', 'race_ethnicity']) \
    .aggregate({'math_score': 'mean', 'reading_score': 'mean'}) \
    .rename(columns = {'math_score': 'mean_math_score', 'reading_score': 'mean_reading_score'})

                       mean_math_score  mean_reading_score
gender race_ethnicity
female group A               58.527778           69.000000
       group B               61.403846           71.076923
       group C               62.033333           71.944444
       group D               65.248062           74.046512
       group E               70.811594           75.840580
male   group A               63.735849           61.735849
       group B               65.930233           62.848837
       group C               67.611511           65.424460
       group D               69.413534           66.135338
       group E               76.746479           70.295775

In [53]:
# если не сбрасывать индексы при группировке по нескольким столбцам, 
# то получим мультииндексы (составные)
# такие индексы значительно усложняют работу с датафреймом

mean_scores = students_performance.groupby(['gender', 'race_ethnicity']) \
    .aggregate({'math_score': 'mean', 'reading_score': 'mean'}) \
    .rename(columns = {'math_score': 'mean_math_score', 'reading_score': 'mean_reading_score'})

mean_scores.index

MultiIndex(levels=[['female', 'male'], ['group A', 'group B', 'group C', 'group D', 'group E']],
           codes=[[0, 0, 0, 0, 0, 1, 1, 1, 1, 1], [0, 1, 2, 3, 4, 0, 1, 2, 3, 4]],
           names=['gender', 'race_ethnicity'])

In [54]:
mean_scores.loc[[('female', 'group A'), ('male', 'group B')]]

                       mean_math_score  mean_reading_score
gender race_ethnicity
female group A               58.527778           69.000000
male   group B               65.930233           62.848837

In [55]:
students_performance.groupby(['gender', 'race_ethnicity']).math_score.nunique()

gender  race_ethnicity
female  group A           29
        group B           51
        group C           59
        group D           53
        group E           44
male    group A           38
        group B           43
        group C           56
        group D           49
        group E           38
Name: math_score, dtype: int64

In [56]:
# найти топ-5 матемитиков-девушек и топ-5 математиков-юношей
students_performance.sort_values(['gender', 'math_score'], ascending=False) \
    .groupby('gender').head(5)

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
149,male,group E,associate's degree,free/reduced,completed,100,100,93
623,male,group A,some college,standard,completed,100,96,86
625,male,group D,some college,standard,completed,100,97,99
916,male,group E,bachelor's degree,standard,completed,100,100,100
306,male,group E,some college,standard,completed,99,87,81
451,female,group E,some college,standard,none,100,92,97
458,female,group E,bachelor's degree,standard,none,100,100,100
962,female,group E,associate's degree,standard,none,100,100,100
114,female,group E,bachelor's degree,standard,completed,99,100,100
263,female,group E,high school,standard,none,99,93,90

In [57]:
students_performance['total_score'] \
    = students_performance['math_score'] \
    + students_performance['reading_score'] \
    + students_performance['writing_score']

students_performance.head()

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,total_score
0,female,group B,bachelor's degree,standard,none,72,72,74,218
1,female,group C,some college,standard,completed,69,90,88,247
2,female,group B,master's degree,standard,none,90,95,93,278
3,male,group A,associate's degree,free/reduced,none,47,57,44,148
4,male,group C,some college,standard,none,76,78,75,229

In [58]:
students_performance = students_performance.assign(
    total_score_log = np.log(students_performance['total_score']))

students_performance.head()

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,total_score,total_score_log
0,female,group B,bachelor's degree,standard,none,72,72,74,218,5.384495
1,female,group C,some college,standard,completed,69,90,88,247,5.509388
2,female,group B,master's degree,standard,none,90,95,93,278,5.627621
3,male,group A,associate's degree,free/reduced,none,47,57,44,148,4.997212
4,male,group C,some college,standard,none,76,78,75,229,5.433722

In [59]:
students_performance.drop(['total_score'], axis=1, inplace=True)
students_performance.head()

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,total_score_log
0,female,group B,bachelor's degree,standard,none,72,72,74,5.384495
1,female,group C,some college,standard,completed,69,90,88,5.509388
2,female,group B,master's degree,standard,none,90,95,93,5.627621
3,male,group A,associate's degree,free/reduced,none,47,57,44,4.997212
4,male,group C,some college,standard,none,76,78,75,5.433722